ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/adpd4000/adpd4000_dcfg.c
/**
    ***************************************************************************
    * @file    adpd4000_dcfg.c
    * @author  ADI Team
    * @version V0.0.1
    * @date    03-April-2018
    * @brief   ADPD4000_default configuration file
    ***************************************************************************
     * @attention
    ***************************************************************************
*/
/*!
 *  \copyright Analog Devices
 * ****************************************************************************
 *
 * License Agreement
 *
 * Copyright (c) 2019 Analog Devices Inc.
 * All rights reserved.
 *
 * This source code is intended for the recipient only under the guidelines of
 * the non-disclosure agreement with Analog Devices Inc.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
 * EXPRESS OR  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
 * CLAIM, DAMAGES OR OTHER  LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
 * TORT OR OTHERWISE, ARISING  FROM, OUT OF OR IN CONNECTION WITH THE
 * SOFTWARE OR THE USE OR OTHER  DEALINGS IN THE SOFTWARE.
 * ****************************************************************************
 */

#include "nrf_log_ctrl.h"

/* System Task Module Log settings */
#define NRF_LOG_MODULE_NAME ADPD4000

#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();

#include <stdlib.h>
#include <adpd4000_dcfg.h>
#include <adpd400x_drv.h>
#include <adpd400x_reg.h>
#include <sensor_adpd_application_interface.h>
#include "adi_adpd_ssm.h"
#ifdef DCB
#include "adi_dcb_config.h"
#include "dcb_interface.h"
#endif
#include "adi_calendar.h"

#define MAXADPD4000DCFGSIZE (228) /* Max 4*57 registers */

#ifdef DCB
static volatile bool g_adpd4000_dcb_present = false;
static uint32_t g_current_dcb[MAX_ADPD4000_DCB_PKTS*MAXADPD4000DCBSIZE] = {'\0'};
#endif
extern uint32_t  g_therm_slot_en_bit_mask;
extern uint32_t Ppg_Slot;
extern uint32_t gn_led_slot_g;
extern uint32_t gn_led_slot_r;
extern uint32_t gn_led_slot_ir;
extern uint32_t gn_led_slot_b;
extern uint8_t dvt2;

static uint32_t g_created_dcfg[MAXADPD4000DCFGSIZE] = {'\0'};
bool check_dcfg_created = false;
#ifdef SLOT_SELECT
extern bool check_temp_slot_set;
bool check_ppg_slot_set = false;
#endif
static uint32_t g_current_dcfg[MAXADPD4000DCFGSIZE] = {'\0'};


#ifdef EVTBOARD

#define GENERAL_DCFG_SIZE 14 /* No. of registers common for all the slots */
#define SLOT_DCFG_SIZE 17 /* No. of registers per slot */
uint32_t slot_general_dcfg[SLOT_DCFG_SIZE] = {'\0'};

/* used as a reference to create dcfg for different slots */
const uint32_t slotA_default_dcfg_4000[] = {
  0x01000000,
  0x01010000,
  0x01020000,
  0x01030000,
  0x01040000,
  0x01050000,
  0x01060000,
  0x01070000,
  0x01080000,
  0x01090000,
  0x010A0000,
  0x010B0000,
  0x010C0000,
  0x010D0000,
  0x010E0000,
  0x010F0000,
  0x01100000
};

/* stores general registers common for all the slots */
const uint32_t general_dcfg_4000_g[] = {
    0x00090097,
    0x00078FFF,
    0x000B02F6,
    0x000C0012,
#ifdef SLOT_SELECT
    0x000D0D05,//0x0D05 -> 300Hz
#else
    0x000D4E20, //50Hz
#endif
    0x000E0000,
    0x000F0006,
    0x00148000,
#ifdef SLOT_SELECT
    0x00202022,
#else
    0x00202222,
#endif
#ifdef SLOT_SELECT
    0x00210014,//IN7 and IN8 configured as a differential pair
#else
    0x00210010,
#endif
    0x00220083, //GPIO0 - Output Inverted, GPIO2 - Output Normal
    0x00230302,
    0x00240000, //GPIO2 - Output Logic = 0
    0x00100000, //opmode
    };

/* stores register values for ppg/green_led config */
const uint32_t ppg_dcfg_4000_g[] = {
    0x00004000, //wrt slot-F reg-> 0x01A0
    0x000041DA, //0x01A1
    0x00000005, //0x01A2
    0x00005002, //0x01A3
    0x0000E3D2,//0x01A4E2C1, //0x01A4 //This setting is for DVT1
#ifdef DVT
    0x00000005,//0040 //0x01A5
#elif PCBA
    0x00000500, //0x01A5
#else
    0x00000005,//0040 //0x01A5
#endif
    0x00000000, //0x01A6
    0x00000140, // 64 pulse //0x01A7
    0x00000000, //0x01A8
    0x00000210, //0x01A9
    0x00000003, //0x01AA
    0x00001010, //0x01AB
    0x00000101, //0x01AC
    0x00000099, //0x01AD
    0x00000000, //0x01AE
    0x00000000, //0x01AF
    0x00000004  //signal size = 4 bytes //0x01B0
};

/* stores register values for temp_calibration_resistor config */
const uint32_t temp_cal_dcfg_4000[] = {
    0x00000000, //0
    0x000041DA, //1
    0x00000030, //2
    0x00005A4F, //3
    0x0000E281, //4 //This setting is for DVT1
    0x00000000, //5
    0x00000000, //6
    0x00000101, //7
    0x00000000, //8
    0x00000210, //9 //DEFAULT
    0x00000003, //10
    0x0000130F, //11
    0x00000210, //12
    0x00000000, //13
    0x00000000, //14
    0x00000000, //15
    0x00000004 //16 //signal size = 4 bytes
    };

/* stores register values for temp_thermistor config */
const uint32_t temp_thermistor_dcfg_4000[] = {
    0x00000000, //0
    0x000041DA, //1
    0x00000010, //2
    0x00005A4F, //3
    0x0000E281, //4 //This setting is for DVT1
    0x00000000, //5
    0x00000000, //6
    0x00000101, //7
    0x00000000, //8
    0x00000210, //9 //DEFAULT
    0x00000003, //10
    0x0000130F, //11
    0x00000210, //12
    0x00000000, //13
    0x00000000, //14
    0x00000000, //15
    0x00000004 //16 //signal size = 4 bytes
    };

/* stores register values for ecg config */
const uint32_t ecg_dcfg_4000[] = {
    0x00000000, //0
    0x000000E6, //1
    0x00000700, //2
    0x000000C0, //3 //VC2 active state = GND
    0x0000E2C1, //4 //This setting is for DVT1
    0x00000000, //5
    0x00000000, //6
    0x00000102, //7
    0x00001000, //8
    0x00000210, //9 //DEFAULT
    0x00000003, //10
    0x0000000D, //11
    0x00000210, //12
    0x00000000, //13
    0x00000000, //14
    0x00000000, //15
    0x00000003 //16 //signal size = 3 bytes
    };

/* stores register values for red_led config */
const uint32_t dcfg_4000_r[] = {
    0x00004000, //0
    0x000041DA, //1
    0x00000005, //2
    0x00005002, //3
    0x0000E3D2, //4 //This setting is for DVT1
    0x00000000, //5
    0x00000005, //6
    0x00000140, //7
    0x00000000, //8
    0x00000210, //9 //DEFAULT
    0x00000003, //10 //DEFAULT
    0x00001010, //11
    0x00000101, //12
    0x00000099, //13
    0x00000000, //14
    0x00000000, //15
    0x00000004 //16 //signal size = 4 bytes
    };

/* stores register values for ir_led config */
const uint32_t dcfg_4000_ir[] = {
    0x00004000, //0
    0x000041DA, //1
    0x00000005, //2
    0x00005002, //3
    0x0000E3D2, //4 //This setting is for DVT1
#ifdef DVT
    0x00000500, //5
#elif PCBA
    0x00000005, //5
#else
    0x00000500, //5
#endif
    0x00000000, //6
    0x00000140, //7
    0x00000000, //8
    0x00000210, //9 //DEFAULT
    0x00000003, //10 //DEFAULT
    0x00001010, //11
    0x00000101, //12
    0x00000099, //13
    0x00000000, //14
    0x00000000, //15
    0x00000004 //16 //signal size = 4 bytes
    };

/* stores register values for blue_led config */
const uint32_t dcfg_4000_b[] = {
    0x00004000, //0
    0x000041DA, //1
    0x00000005, //2
    0x00005002, //3
    0x0000E3D2, //4 //This setting is for DVT1
    0x00000000, //5
    0x00000500, //6
    0x00000140, //7
    0x00000000, //8
    0x00000210, //9 //DEFAULT
    0x00000003, //10 //DEFAULT
    0x00001010, //11
    0x00000101, //12
    0x00000099, //13
    0x00000000, //14
    0x00000000, //15
    0x00000004 //16 //signal size = 4 bytes
    };

