ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/adpd4000/adpd4000_dcfg.c
/*
* ppg_dcfg_4000_g at idx = 1 -> specifies app id for ppg
* ppg_dcfg_4000_g at idx = 4 -> specifies app id for adpd_g raw data stream
* ppg_dcfg_4000_g at both the indices in the array needs to be maintained
*/
const uint32_t* app_dcfg_list[] = {ecg_dcfg_4000, ppg_dcfg_4000_g, temp_thermistor_dcfg_4000, temp_cal_dcfg_4000, ppg_dcfg_4000_g, dcfg_4000_r, dcfg_4000_ir, dcfg_4000_b};

const uint32_t dcfg_org_4000_g[] = {
    //0x000F8000,
    0x00090097,
    0x00078FFF,
    0x000B02F6,
    0x000C0012,
    0x000D4E20,//50Hz
    0x000E0000,
    0x000F0006,
    0x00148000,
    0x00200022, //IN5+IN6 & IN7+IN8 floating during sleep
    0x00210014, //IN5/IN6 configured as a differential pair  //0x00210000
    0x00220083, //GPIO0 - Output Inverted, GPIO2 - Output Normal
    0x00230302,
    0x00240000, //GPIO2 - Output Logic = 0
    0x01310000, // DATA2_B
    0x01510000, // DATA2_C
    0x01710000, // DATA2_D
    0x01910000, // DATA2_E
    0x01B10000, // DATA2_F
    0x01D10000, // DATA2_G
#if 1
// Slots config
/// Timeslot A - Sleep float mode ECG with multiple charge tranfers
/// IN5 and IN6 as differential pair
  0x01000000,  //  CH2 Disabled, Input resistor 500 ohms 0000, 6.25k ohms 0400
  0x010100E6,  //  skip preconditioning, No bpf
  0x01020700,  // IN5&IN6 differential pair to CH 1
  0x010300C0,  // VC2 active state = GND
  0x0104E2C1,  // TIA gain, 2C0 200k, 2C1 100k, Vref = 0.88V  //This setting is for DVT1
  0x01070102,  // number of pulses = 2
  0x01081000,  // float mode, min period
  0x010A0003, // Int width
  0x010B000D, // Integrator timing offset
  0x010C0210, // Mod pulse width, mod offset 16us
  0x010D0000,// No Chop
  0x010E0000,
  0x010F0000,
  0x01100003,  // 3 bytes signal
  0x01050000,  // LEDs off
  0x01060000,  // LEDs off
#endif
/*Configuration for Time slot F*/
    0x01A04000, //CH2 enable
    //0x01A00000,
    0x01A141DA,
    0x01A20005,
    0x01A35002,
    //0x01A4E2C1,
    0x01A4E3D2, //TIA GAIN, CH1 = CH2 = 50k //This setting is for DVT1
#ifdef DVT
    0x01A50005,
#elif PCBA
    0x01A50500,
#else
    0x01A50005,//0040
#endif
    0x01A60000,
    0x01A70140, // 64 pulse
#if 0
    0x01AB0E10,
    0x01AD0000, //  No chop
    0x01AE1F00,
    0x01AF1F00,
#endif
    //0x01A90000,//added
#if 1
    0x01A80000, // PERIOD_F
    0x01A90210, // LED_PULSE_F
    0x01AA0003, // INTEG_SETUP_F
    0x01AB1010, // INTEG_OS_F
    0x01AC0101, // MOD_PULSE_F
    0x01AD0099, // PATTERN_F Reset value, chop -++-
    0x01AE0000,
    0x01AF0000,
    0x01B00004,  // DATA_FORMAT_F
    0x01B20000,  // DECIMATE_F
    0x01B30026,  // DIGINT_LIT_F
    0x01B42306,  // DIGINT_DARK_F
    0x01B50000,  // THRESH_CFG_F
    0x01B60000,  // THRESH0_F
    0x01B70000,  // THRESH1_F
#endif
    //0x01200010,
    0x00100500, /* Enable slot F for green LED data*/

/*Moving thermistor sensor to slot D*/
#if 1
    0x01600000,   /*INPUT_RESISTOR set ot 500 ohm*/
    0x016141DA,   /*pre conditioning period of 8us, TIA+INT+BPF+ADC signal path selected for Slot A */
    0x01620010,   /*IN3 connected to CH1 of slot A*/
    0x01635A4F,   /*Pre condition with TIA V_ref,VC2_pulse changes between active state and alternate state,
                    VC2_Active = V-ref and VC2_alternate = V_ref + 250mV*/
    0x0164E281,   /* R_int = 400K, R_tia_c h1 = 100k, TIA_Vref = 0.8855  V, Vref_pulse = 0.8855 V; No v-ref pulsing */ //This setting is for DVT1
    0x01650000,
    0x01660000,
    0x01670101,   /*single pulse and single repition is used*/
    0x01680000,   /*MOD_TYPE set to mode 0; normal mode*/
    //0x01690419,   /*LED pulse width and offset*/
    0x016A0003,   /*Integrator clock width set to 3us*/
    0x016B130F,   /*Integrator offset set to 15.595us*/
    0x016C0210,   /*Modulation pulse width set to 2us, with offset of 16us*/
    0x016E0000,   /*ADC CH1 offset set to 0*/
    0x016F0000,   /*ADC CH2 offset set to 0*/
    0x01700004,   /* signal size Data format set to 4 bytes;*/
    //0x01720310,   /* Decimation set to 50 */
#endif //slot D

/*Moving calibration resistor to slot E*/
#if 1
    0x01800000,   /*INPUT_RESISTOR set ot 500 ohm*/
    0x018141DA,   /*pre conditioning period of 8us, TIA+INT+BPF+ADC signal path selected for Slot B */
    0x01820030,   /*IN4 connected to CH1 of slot B*/
    0x01835A4F,   /*Pre condition with TIA V_ref,VC2_pulse changes between active state and alternate state,
                    VC2_Active = V-ref and VC2_alternate = V_ref + 250mV*/
    0x0184E281,   /* R_int = 400K, R_tia_c h1 = 100k, TIA_Vref = 0.8855  V, Vref_pulse = 0.8855 V; No v-ref pulsing */ //This setting is for DVT1
    0x01850000,
    0x01860000,
    0x01870101,   /*single pulse and single repition is used*/
    0x01880000,   /*MOD_TYPE set to mode 0; normal mode*/
    //0x01890419,   /*LED pulse width and offset*/
    0x018A0003,   /*Integrator clock width set to 3us*/
    0x018B130F,   /*Integrator offset set to 15.595us*/
    0x018C0210,   /*Modulation pulse width set to 2us, with offset of 16us*/
    0x018E0000,   /*ADC CH1 offset set to 0*/
    0x018F0000,   /*ADC CH2 offset set to 0*/
    0x01900004,   /*signal size data format set to 4 bytes; */
    //0x01920310,   /* Decimation set to 50 */
#endif //slot E

/* Set the signal and dark sample data size of the slots from A to E to zero*/
    0x01300000,
    0x01500000,
    //0x01700000,
    //0x01900000,
    0x01B00004,
    0xFFFFFFFF,
};

const uint32_t dcfg_org_4000_r[] = {
    0x00090097,
    0x00078FFF,
    0x000B02F6,
    0x000C0012,
    0x000D4E20,//0x2710
    0x000E0000,
    0x000F0006,
    0x00148000,
    0x00202222,
    0x00210010,
    0x00220003,
    0x00230302,
    0x00240001,

/*Configuration for Time slot G*/
    0x01C04000, //CH2 enable
    0x01C141DA,
    0x01C20005,
    0x01C35002,
    0x01C403D2, //TIA GAIN, CH1 = CH2 = 50k
    0x01C50000,
    0x01C60005, //Red 3A
    0x01C70140,
    0x01C80000, // PERIOD_G
    0x01C90210, // LED_PULSE_G
    0x01CA0003, // INTEG_SETUP_G
    0x01CB1010, // INTEG_OS_G
    0x01CC0101, // MOD_PULSE_G
    0x01CD0099, // PATTERN_G Reset value, chop -++-
    0x01CE0000,
    0x01CF0000,
    0x01D00004,  // DATA_FORMAT_G
    0x01D20000,  // DECIMATE_G
    0x00100600, /* Enable slot G for RED LED data*/

