ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/adpd4000/adpd4000_dcfg.c
/* Set the signal and dark sample data size of the slots from A to F to zero*/
    0x01100000,
    0x01300000,
    0x01500000,
    0x01700000,
    0x01900000,
    0x01B00000,
};

const uint32_t dcfg_org_4000_ir[] = {
    0x00090097,
    0x00078FFF,
    0x000B02F6,
    0x000C0012,
    0x000D4E20,//0x2710
    0x000E0000,
    0x000F0006,
    0x00148000,
    0x00202222,
    0x00210010,
    0x00220003,
    0x00230302,
    0x00240001,

/*Configuration for Time slot H*/
    0x01E04000, //CH2 enable
    0x01E141DA,
    0x01E20005,
    0x01E35002,
    0x01E403D2, //TIA GAIN, CH1 = CH2 = 50k
#ifdef DVT
    0x01E50500, //IR 2A
#elif PCBA
    0x01E50005,
#else
    0x01E50500,
#endif
    0x01E60000,
    0x01E70140,
    0x01E80000, // PERIOD_H
    0x01E90210, // LED_PULSE_H
    0x01EA0003, // INTEG_SETUP_H
    0x01EB1010, // INTEG_OS_H
    0x01EC0101, // MOD_PULSE_H
    0x01ED0099, // PATTERN_H Reset value, chop -++-
    0x01EE0000,
    0x01EF0000,
    0x01F00004,  // DATA_FORMAT_H
    0x01F20000,  // DECIMATE_H
    0x00100700, /* Enable slot H for IR LED data*/

/* Set the signal and dark sample data size of the slots from A to G to zero*/
    0x01100000,
    0x01300000,
    0x01500000,
    0x01700000,
    0x01900000,
    0x01B00000,
    0x01D00000,
};

const uint32_t dcfg_org_4000_b[] = {
    0x00090097,
    0x00078FFF,
    0x000B02F6,
    0x000C0012,
    0x000D4E20,//0x2710
    0x000E0000,
    0x000F0006,
    0x00148000,
    0x00202222,
    0x00210010,
    0x00220003,
    0x00230302,
    0x00240001,

/*Configuration for Time slot I*/
    0x02004000, //CH2 enable
    0x020141DA,
    0x02020005,
    0x02035002,
    0x020403D2, //TIA GAIN, CH1 = CH2 = 50k
    0x02050000,
    0x02060500, //Blue 4A
    0x02070140,
    0x02080000, // PERIOD_I
    0x02090210, // LED_PULSE_I
    0x020A0003, // INTEG_SETUP_I
    0x020B1010, // INTEG_OS_I
    0x020C0101, // MOD_PULSE_I
    0x020D0099, // PATTERN_I Reset value, chop -++-
    0x020E0000,
    0x020F0000,
    0x02100004,  // DATA_FORMAT_I
    0x02120000,  // DECIMATE_I
    0x00100800, /* Enable slot I for bLUE LED data*/

/* Set the signal and dark sample data size of the slots from A to H to zero*/
    0x01100000,
    0x01300000,
    0x01500000,
    0x01700000,
    0x01900000,
    0x01B00000,
    0x01D00000,
    0x01F00000,
};

const uint32_t dcfg_4000_temperature[] = {
    //0x000F8000,
    0x00090097,
    0x00078FFF,
    0x000B02F6,
    0x000C0012,
    0x000D2710,
    0x000E0000,
    0x000F0006,
    0x00148000,
    0x00200000,
    0x00210010,
    0x00220003,
    0x00230302,
    0x00240001,

    /*Moving thermistor sensor to slot D*/
#if 1
    0x01600000,   /*INPUT_RESISTOR set ot 500 ohm*/
    0x016141DA,   /*pre conditioning period of 8us, TIA+INT+BPF+ADC signal path selected for Slot A */
    0x01620010,   /*IN3 connected to CH1 of slot A*/
    0x01635A4F,   /*Pre condition with TIA V_ref,VC2_pulse changes between active state and alternate state,
                    VC2_Active = V-ref and VC2_alternate = V_ref + 250mV*/
    0x01640281,   /* R_int = 400K, R_tia_c h1 = 100k, TIA_Vref = 0.8855  V, Vref_pulse = 0.8855 V; No v-ref pulsing */
    0x01650000,
    0x01660000,
    0x01670101,   /*single pulse and single repition is used*/
    0x01680000,   /*MOD_TYPE set to mode 0; normal mode*/
    //0x01690419,   /*LED pulse width and offset*/
    0x016A0003,   /*Integrator clock width set to 3us*/
    0x016B130F,   /*Integrator offset set to 15.595us*/
    0x016C0210,   /*Modulation pulse width set to 2us, with offset of 16us*/
    0x016E0000,   /*ADC CH1 offset set to 0*/
    0x016F0000,   /*ADC CH2 offset set to 0*/
    0x01700004,   /* signal size Data format set to 4 bytes;*/
#endif //slot A

#if 1
    /*Moving calibration resistor to slot E*/
    0x01800000,   /*INPUT_RESISTOR set ot 500 ohm*/
    0x018141DA,   /*pre conditioning period of 8us, TIA+INT+BPF+ADC signal path selected for Slot B */
    0x01820030,   /*IN4 connected to CH1 of slot B*/
    0x01835A4F,   /*Pre condition with TIA V_ref,VC2_pulse changes between active state and alternate state,
                    VC2_Active = V-ref and VC2_alternate = V_ref + 250mV*/
    0x01840281,   /* R_int = 400K, R_tia_c h1 = 100k, TIA_Vref = 0.8855  V, Vref_pulse = 0.8855 V; No v-ref pulsing */
    0x01850000,
    0x01860000,
    0x01870101,   /*single pulse and single repition is used*/
    0x01880000,   /*MOD_TYPE set to mode 0; normal mode*/
    //0x01890419,   /*LED pulse width and offset*/
    0x018A0003,   /*Integrator clock width set to 3us*/
    0x018B130F,   /*Integrator offset set to 15.595us*/
    0x018C0210,   /*Modulation pulse width set to 2us, with offset of 16us*/
    0x018E0000,   /*ADC CH1 offset set to 0*/
    0x018F0000,   /*ADC CH2 offset set to 0*/
    0x01900004,   /*signal size data format set to 4 bytes; */
#endif //slot B
    0xFFFFFFFF,
};

#else
/* Default configurations for slotA and slotB */
/* TODO: slotC to slotL*/
const uint32_t dcfg_org_4000_g[] = {
      //0x000F8000,
    0x00090097,
    0x00078FFF,
    0x000B02F6,
    0x000C0012,
    0x000D4E20,//0x2710
    0x000E0000,
    0x000F0006,
    0x00148000,
    0x00202222,
    0x00210010,
    0x00220003,
    0x00230302,
    0x00240001,
/*Configuration for Time slot F*/
    0x01A00000,
    0x01A141DA,
    0x01A20003,
    0x01A35002,
    //0x01A4E2C1,
    0x01A50002,//0040
    0x01A60000,


    0x01A70101,
    //0x01A90000,//added
    0x01AB0E10,
    0x01AE1F00,
    0x01AF0000,
    //0x01100004,
    //0x01200010,
    0x00100500, /* Enable slot F for green LED data*/

/* Set the signal and dark sample data size of the slots from A to E to zero*/
    0x01100000,
    0x01300000,
    0x01500000,
    0x01700000,
    0x01900000,
    0x01B00004,
};
#endif //EVTBOARD

const uint32_t dcfg_org_4000_g_r_ir_b[] = {
    0x00090097,
    0x00078FFF,
    0x000B02F6,
    0x000C0012,
    0x000D4E20,//0x2710
    0x000E0000,
    0x000F0006,
    0x00148000,
    0x00202222,
    0x00210010,
    0x00220003,
    0x00230302,
    0x00240001,
    0x01310000, // DATA2_B
    0x01510000, // DATA2_C
    0x01710000, // DATA2_D
    0x01910000, // DATA2_E
    0x01B10000, // DATA2_F
    0x01D10000, // DATA2_G
/*Configuration for Time slot F*/
    0x01A04000, //CH2 enable
    0x01A141DA,
    0x01A20005,
    0x01A35002,
    0x01A403D2, //TIA GAIN, CH1 = CH2 = 50k
    0x01A50005, //Green - 1A
    0x01A60000,
    0x01A70140, // 64 pulse
    0x01A80000, // PERIOD_F
    0x01A90210, // LED_PULSE_F
    0x01AA0003, // INTEG_SETUP_F
    0x01AB1010, // INTEG_OS_F
    0x01AC0101, // MOD_PULSE_F
    0x01AD0099, // PATTERN_F Reset value, chop -++-
    0x01AE0000,
    0x01AF0000,
    0x01B00004,  // DATA_FORMAT_F
    0x01B20000,  // DECIMATE_F
    //0x00100500, /* Enable slot F for green LED data*/

/*Configuration for Time slot G*/
    0x01C04000, //CH2 enable
    0x01C141DA,
    0x01C20005,
    0x01C35002,
    0x01C403D2, //TIA GAIN, CH1 = CH2 = 50k
    0x01C50000,
    0x01C60005, //Red 3A
    0x01C70140,
    0x01C80000, // PERIOD_G
    0x01C90210, // LED_PULSE_G
    0x01CA0003, // INTEG_SETUP_G
    0x01CB1010, // INTEG_OS_G
    0x01CC0101, // MOD_PULSE_G
    0x01CD0099, // PATTERN_G Reset value, chop -++-
    0x01CE0000,
    0x01CF0000,
    0x01D00004,  // DATA_FORMAT_G
    0x01D20000,  // DECIMATE_G
    //0x00100600, /* Enable slot G for RED LED data*/

/*Configuration for Time slot H*/
    0x01E04000, //CH2 enable
    0x01E141DA,
    0x01E20005,
    0x01E35002,
    0x01E403D2, //TIA GAIN, CH1 = CH2 = 50k
    0x01E50500, //IR 2A
    0x01E60000,
    0x01E70140,
    0x01E80000, // PERIOD_H
    0x01E90210, // LED_PULSE_H
    0x01EA0003, // INTEG_SETUP_H
    0x01EB1010, // INTEG_OS_H
    0x01EC0101, // MOD_PULSE_H
    0x01ED0099, // PATTERN_H Reset value, chop -++-
    0x01EE0000,
    0x01EF0000,
    0x01F00004,  // DATA_FORMAT_H
    0x01F20000,  // DECIMATE_H
    //0x00100700, /* Enable slot H for IR LED data*/

