ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/adpd4000/adpd4000_dcfg.c
/*Configuration for Time slot I*/
    0x02004000, //CH2 enable
    0x020141DA,
    0x02020005,
    0x02035002,
    0x020403D2, //TIA GAIN, CH1 = CH2 = 50k
    0x02050000,
    0x02060500, //Blue 4A
    0x02070140,
    0x02080000, // PERIOD_I
    0x02090210, // LED_PULSE_I
    0x020A0003, // INTEG_SETUP_I
    0x020B1010, // INTEG_OS_I
    0x020C0101, // MOD_PULSE_I
    0x020D0099, // PATTERN_I Reset value, chop -++-
    0x020E0000,
    0x020F0000,
    0x02100004,  // DATA_FORMAT_I
    0x02120000,  // DECIMATE_I
    0x00100800, /* Enable slot I for bLUE LED data*/

/* Set the signal and dark sample data size of the slots from A to E to zero*/
    0x01100000,
    0x01300000,
    0x01500000,
    0x01700000,
    0x01900000,
};

///////////////////////////////////////
typedef struct
{
/* Application related parameter */
  float ECGODR;                 /* Must be less than 1500Hz. Sample frequency in Hz, this value is used to set Sleep Wakeup Timer period */
}AppECG4kCfg_Type;

AppECG4kCfg_Type AppECG4kCfg =
{
  .ECGODR = 300.0,           /* 300.0 Hz*/
};
////////////////////////////////////////

/* Function to patch the dcfg with register address-value pairs that have


** changed in DVT2 board with ADPD4100
** @param None
*/
void patch_dvt2_adpd4100_reg()
{
  //Slot A
  adi_adpddrv_RegWrite(0x010B, 0x01A0);//INTEG_OS_A
  adi_adpddrv_RegWrite(0x0104, 0x02C1);//AFE_TRIM_A
  //Slot D
  adi_adpddrv_RegWrite(0x0161, 0x40DA);//TS_PATH_D
  adi_adpddrv_RegWrite(0x016B, 0x01F3);//INTEG_OS_D
  //Slot E
  adi_adpddrv_RegWrite(0x0181, 0x40DA);//TS_PATH_E
  adi_adpddrv_RegWrite(0x018B, 0x01F3);//INTEG_OS_E
  //Slot F
  adi_adpddrv_RegWrite(0x01A1, 0x40DA);//TS_PATH_F
  adi_adpddrv_RegWrite(0x01AB, 0x0210);//INTEG_OS_F
  //Slot G
  adi_adpddrv_RegWrite(0x01C1, 0x40DA);//TS_PATH_G
  adi_adpddrv_RegWrite(0x01CB, 0x0210);//INTEG_OS_G
  //Slot H
  adi_adpddrv_RegWrite(0x01E1, 0x40DA);//TS_PATH_H
  adi_adpddrv_RegWrite(0x01EB, 0x0210);//INTEG_OS_H
  //Slot I
  adi_adpddrv_RegWrite(0x0201, 0x40DA);//TS_PATH_I
  adi_adpddrv_RegWrite(0x020B, 0x0210);//INTEG_OS_I
}

/**
* @brief    Load ADPD4000 Default configuration
* @param    device_id - Adpd4000 device index/type
* @retval   Status
*/
ADPD4000_DCFG_STATUS_t load_adpd4000_cfg(uint16_t device_id)
{
    ADPD4000_DCFG_STATUS_t cfg_status = ADPD4000_DCFG_STATUS_ERR;
    ADPD4000_DCB_STATUS_t ret;
#ifdef DCB
    bool dcb_cfg = false;
    dcb_cfg = adpd4000_get_dcb_present_flag();
    if(dcb_cfg == true)
    {
        //Load dcb Settings
        ret = load_adpd4000_dcb(device_id);
        cfg_status = (!ret) ? ADPD4000_DCFG_STATUS_OK : ADPD4000_DCFG_STATUS_ERR;
        //NRF_LOG_INFO("Load DCB dcfg");
    }
    else
    {
#endif
        // Load dcfg Settings
        cfg_status = load_adpd4000_dcfg(device_id);
        //NRF_LOG_INFO("Load Default f/w dcfg");

        //Check if its DVT2 chip, if so apply register patches
        if( dvt2 )
        {
          patch_dvt2_adpd4100_reg();
        }

#ifdef DCB
    }
#endif

    return cfg_status;
}

#ifdef EVTBOARD
ADPD4000_DCFG_STATUS_t load_temperature_dcfg ()
{
  adi_adpddrv_SoftReset();
  adi_adpddrv_OpenDriver();
  memcpy(&g_current_dcfg[0], &dcfg_4000_temperature[0], sizeof(dcfg_4000_temperature));
  if (write_adpd4000_dcfg(&g_current_dcfg[0]) != ADPD4000_DCFG_STATUS_OK) {
    return ADPD4000_DCFG_STATUS_ERR;
  }
  return ADPD4000_DCFG_STATUS_OK;
}
#endif

/**
* @brief    Load ADPD4000 Default configuration
* @param    device_id - Adpd4000 device index/type
* @retval   Status
*/
ADPD4000_DCFG_STATUS_t load_adpd4000_dcfg(uint16_t device_id) {
  if (device_id == 0) {
    adi_adpddrv_OpenDriver();
    return ADPD4000_DCFG_STATUS_OK;
  }
  if (device_id != 0) {
    stage_adpd4000_dcfg(&device_id);
  }
  adi_adpddrv_SoftReset();
  //adi_adpddrv_OpenDriver();
  if (write_adpd4000_dcfg(&g_current_dcfg[0]) != ADPD4000_DCFG_STATUS_OK) {
    return ADPD4000_DCFG_STATUS_ERR;
  }
  return ADPD4000_DCFG_STATUS_OK;
}

/**
* @brief    Gets the entire ADPD current device configuration
* @param    pDcfg - pointer to dcfg register/value pairs
* @retval   Status
*/
ADPD4000_DCFG_STATUS_t read_adpd4000_dcfg(uint32_t *p_dcfg, uint16_t *p_dcfg_size) {
  uint16_t reg_addr;
  uint16_t reg_data;
  int i = 0;
  if (p_dcfg == NULL) {
    return ADPD4000_DCFG_STATUS_NULL_PTR;
  }

  /*for (int i = 0; g_current_dcfg[i]!= 0xFFFFFFFF; i++) {
    reg_addr = (uint16_t) (g_current_dcfg[i] >> 16);
    if (adi_adpddrv_RegRead(reg_addr, &reg_data) != ADPD400xDrv_SUCCESS) {
      return ADPD4000_DCFG_STATUS_ERR;
    }
    *p_dcfg = (reg_addr << 16) | reg_data;
    p_dcfg++;
    *p_dcfg_size = i + 1;
  }*/
    if (adi_adpddrv_RegRead(ADPD400x_REG_OSC32M, &reg_data) != ADPD400xDrv_SUCCESS) {
    return ADPD4000_DCFG_STATUS_ERR;
    }
    *p_dcfg = (ADPD400x_REG_OSC32M << 16) | reg_data;
    p_dcfg++;
    *p_dcfg_size = i + 1;
    i++;

    if (adi_adpddrv_RegRead(ADPD400x_REG_INT_ACLEAR, &reg_data) != ADPD400xDrv_SUCCESS) {
    return ADPD4000_DCFG_STATUS_ERR;
    }
    *p_dcfg = (ADPD400x_REG_INT_ACLEAR << 16) | reg_data;
    p_dcfg++;
    *p_dcfg_size = i + 1;
    i++;

     if (adi_adpddrv_RegRead(ADPD400x_REG_OSC1M, &reg_data) != ADPD400xDrv_SUCCESS) {
    return ADPD4000_DCFG_STATUS_ERR;
    }
    *p_dcfg = (ADPD400x_REG_OSC1M << 16) | reg_data;
    p_dcfg++;
    *p_dcfg_size = i + 1;
    i++;

   if (adi_adpddrv_RegRead(ADPD400x_REG_OSC32K, &reg_data) != ADPD400xDrv_SUCCESS) {
    return ADPD4000_DCFG_STATUS_ERR;
    }
    *p_dcfg = (ADPD400x_REG_OSC32K << 16) | reg_data;
    p_dcfg++;
    *p_dcfg_size = i + 1;
    i++;

    if (adi_adpddrv_RegRead(ADPD400x_REG_TS_FREQ, &reg_data) != ADPD400xDrv_SUCCESS) {
    return ADPD4000_DCFG_STATUS_ERR;
    }
    *p_dcfg = (ADPD400x_REG_TS_FREQ << 16) | reg_data;
    p_dcfg++;
    *p_dcfg_size = i + 1;
    i++;

     if (adi_adpddrv_RegRead(ADPD400x_REG_TS_FREQH, &reg_data) != ADPD400xDrv_SUCCESS) {
    return ADPD4000_DCFG_STATUS_ERR;
    }
    *p_dcfg = (ADPD400x_REG_TS_FREQH << 16) | reg_data;
    p_dcfg++;
    *p_dcfg_size = i + 1;
    i++;

    if (adi_adpddrv_RegRead(ADPD400x_REG_SYS_CTL, &reg_data) != ADPD400xDrv_SUCCESS) {
    return ADPD4000_DCFG_STATUS_ERR;
    }
    *p_dcfg = (ADPD400x_REG_SYS_CTL << 16) | reg_data;
    p_dcfg++;
    *p_dcfg_size = i + 1;
    i++;

   if (adi_adpddrv_RegRead(ADPD400x_REG_OPMODE, &reg_data) != ADPD400xDrv_SUCCESS) {
      return ADPD4000_DCFG_STATUS_ERR;
      }
      *p_dcfg = (ADPD400x_REG_OPMODE << 16) | reg_data;
      p_dcfg++;
      *p_dcfg_size = i + 1;
      i++;

