ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/adpd4000/adpd4000_dcfg.c
     if (adi_adpddrv_RegRead(ADPD400x_REG_INT_ENABLE_XD, &reg_data) != ADPD400xDrv_SUCCESS) {
    return ADPD4000_DCFG_STATUS_ERR;
    }
    *p_dcfg = (ADPD400x_REG_INT_ENABLE_XD << 16) | reg_data;
    p_dcfg++;
    *p_dcfg_size = i + 1;
    i++;

    if (adi_adpddrv_RegRead(ADPD400x_REG_INPUT_SLEEP, &reg_data) != ADPD400xDrv_SUCCESS) {
    return ADPD4000_DCFG_STATUS_ERR;
    }
    *p_dcfg = (ADPD400x_REG_INPUT_SLEEP << 16) | reg_data;
    p_dcfg++;
    *p_dcfg_size = i + 1;
    i++;

     if (adi_adpddrv_RegRead(ADPD400x_REG_INPUT_CFG, &reg_data) != ADPD400xDrv_SUCCESS) {
    return ADPD4000_DCFG_STATUS_ERR;
    }
    *p_dcfg = (ADPD400x_REG_INPUT_CFG << 16) | reg_data;
    p_dcfg++;
    *p_dcfg_size = i + 1;
    i++;

    if (adi_adpddrv_RegRead(ADPD400x_REG_GPIO_CFG, &reg_data) != ADPD400xDrv_SUCCESS) {
    return ADPD4000_DCFG_STATUS_ERR;
    }
    *p_dcfg = (ADPD400x_REG_GPIO_CFG << 16) | reg_data;
    p_dcfg++;
    *p_dcfg_size = i + 1;
    i++;

    if (adi_adpddrv_RegRead(ADPD400x_REG_GPIO01, &reg_data) != ADPD400xDrv_SUCCESS) {
    return ADPD4000_DCFG_STATUS_ERR;
    }
    *p_dcfg = (ADPD400x_REG_GPIO01 << 16) | reg_data;
    p_dcfg++;
    *p_dcfg_size = i + 1;
    i++;

    if (adi_adpddrv_RegRead(ADPD400x_REG_GPIO23, &reg_data) != ADPD400xDrv_SUCCESS) {
    return ADPD4000_DCFG_STATUS_ERR;
    }
    *p_dcfg = (ADPD400x_REG_GPIO23 << 16) | reg_data;
    p_dcfg++;
    *p_dcfg_size = i + 1;
    i++;

  return ADPD4000_DCFG_STATUS_OK;
}


/**
* @brief    Write a dcfg to device
* @param    p_dcfg - pointer to Dcfg array
* @retval   Status
*/
ADPD4000_DCFG_STATUS_t write_adpd4000_dcfg(uint32_t *p_dcfg) {
  uint16_t reg_addr;
  uint16_t reg_data;

  if (p_dcfg == NULL) {
    return ADPD4000_DCFG_STATUS_NULL_PTR;
  }
  // clear FIFO and IRQs
  adi_adpdssm_setOperationMode(ADPD400xDrv_MODE_IDLE);
  //adi_adpddrv_SetOperationMode(ADPD400xDrv_MODE_PAUSE);

  for (int i = 0; p_dcfg[i]!= 0xFFFFFFFF; i++) {
    reg_addr = (uint16_t) (p_dcfg[i] >> 16);
    reg_data = (uint16_t)(p_dcfg[i]);

    if (adi_adpddrv_RegWrite(reg_addr, reg_data) != ADPD400xDrv_SUCCESS) {
      //adi_adpddrv_SetOperationMode(ADPD400xDrv_MODE_IDLE);
      return ADPD4000_DCFG_STATUS_ERR;
    }
  }
  //adi_adpddrv_SetOperationMode(ADPD400xDrv_MODE_IDLE);
  return ADPD4000_DCFG_STATUS_OK;
}


static uint8_t g_used_slots[SLOT_NUM] = {'\0'};
static uint8_t gNumUsedSlots = 0;
static uint8_t gDcfgMaxSlot = 0;
/***********************************REFERENCE TABLE FOR SLOT-ID and APP-ID ********************************************
        ----------------------------------------   ------------------------------  ------------------------------
        | App-ID |          Apps               |   | Slot- ID  |  ADPD4k_SLOTS  |  | Slot- ID   |  ADPD4k_SLOTS  |
        ----------------------------------------   ------------------------------   ------------------------
        |   0    |          ECG4K              |   |    1      |       A        |   |    9       |     I    |
         ---------------------------------------   ------------------------------   ------------------------
        |   1    |          PPG                |   |    2      |       B        |   |    10      |     J    |
        ----------------------------------------   ------------------------------   ------------------------
        |   2    |    Temp. (Thermistor)       |   |    3      |       C        |   |    11      |     K    |
        ------------------------- --------------   ------------------------------   ------------------------
        |   3    |Temp. (Calibration Resistor) |   |    4      |       D        |   |    12      |     L    |
        ----------------------------------------   ------------------------------   --------------------------
        |   4    |          ADPD4K_G           |   |    5      |       E        |
        ----------------------------------------   ------------------------------
        |   5    |          ADPD4K_R           |   |    6      |       F        |
        ----------------------------------------   ------------------------------
        |   6    |          ADPD4K_IR          |   |    7      |       G        |
        ----------------------------------------   ------------------------------
        |   7    |          ADPD4K_B           |   |    8      |       H        |
        ----------------------------------------  -------------------------------
  *****************************************************************************************************************/
/*!
 ****************************************************************************
 * @brief get the ADPD4k Dcfg based on selected Slot and Application
 *
 * @param[in]          slot id : specifies slot
 * @param[in]          app id  : specifies application
 * @param[in]          index   : iterates over 0 to num_slots
 * @param[in]          num slots: total number of slots required in dcfg
 *
 * @return              status
 *****************************************************************************/
ADPD4000_DCFG_STATUS_t get_adpd4k_dcfg(uint16_t slot_id, uint16_t app_id, uint8_t index, uint8_t num_slots)
{
  uint8_t i = 0, j = 0;
  slot_id = slot_id - 1;/* referring slot id from 0 to 11 */

  if(index == 0)
  {
      memset(&g_created_dcfg, 0xff, sizeof(g_created_dcfg));
      memcpy(&g_created_dcfg, &general_dcfg_4000_g, sizeof(general_dcfg_4000_g));
      gDcfgMaxSlot = slot_id;
  }

  for(i = 0; i < SLOT_DCFG_SIZE ;i++)
  {
   slot_general_dcfg[i] = ((slotA_default_dcfg_4000[i] >> 16) + (ADPD400x_SLOT_BASE_ADDR_DIFF * slot_id)) << 16;
  }

  uint8_t idx = GENERAL_DCFG_SIZE + SLOT_DCFG_SIZE*index;
  for(i = idx; i < (GENERAL_DCFG_SIZE + SLOT_DCFG_SIZE*(index+1)) ;i++)
  {
    g_created_dcfg[i] = slot_general_dcfg[abs(idx- i)] | app_dcfg_list[app_id][abs(idx - i)];
  }
  g_used_slots[gNumUsedSlots++] = slot_id;
  if(slot_id > gDcfgMaxSlot)
  {
    gDcfgMaxSlot = slot_id;/* store the max slot in dcfg to set the opmode */
  }

  if(index == num_slots - 1)
  {
   /* Enable Slots */
   g_created_dcfg[GENERAL_DCFG_SIZE-1] = ((ADPD400x_REG_OPMODE << 16) | (gDcfgMaxSlot << 8));
   check_dcfg_created = true;

   /* set signal size = 0 for slots that are enabled but not in use */
   idx = (GENERAL_DCFG_SIZE + SLOT_DCFG_SIZE*(index+1));
   uint16_t reg_base = 0;
   for(i = 0; i <= slot_id ;i++)
   {
     for(j = 0; j < gNumUsedSlots; j++)
     {
        if(i == g_used_slots[j])
        {
          break;
        }
     }
     if(j == gNumUsedSlots)
     {
       reg_base = i * ADPD400x_SLOT_BASE_ADDR_DIFF;
       g_created_dcfg[idx++] = (ADPD400x_REG_DATA1_A + reg_base) << 16;
     }
   }

   memset(&g_used_slots, '\0', sizeof(g_used_slots));
   gNumUsedSlots = 0;
  }

#ifdef SLOT_SELECT
  //set Temp. Slot
  if(app_id == 2)
  {
    g_therm_slot_en_bit_mask = (1 << slot_id) | ( 1 << (slot_id+1));
    check_temp_slot_set = true;
  }

  //set PPG Slot
  if(app_id == 1)
  {
    Ppg_Slot = 1 << slot_id;
    check_ppg_slot_set = true;
  }

  if(app_id == 4) //adpd4000_g
  {
    gn_led_slot_g |= 1 << slot_id;
  }

