ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/adpd4000/adpd4000_dcfg.c
  if(app_id == 5) //adpd4000_r
  {
    gn_led_slot_r |= 1 << slot_id;
  }

  if(app_id == 6) //adpd4000_ir
  {
    gn_led_slot_ir |= 1 << slot_id;
  }

  if(app_id == 7) //adpd4000_b
  {
    gn_led_slot_b |= 1 << slot_id;
  }
#endif
 return ADPD4000_DCFG_STATUS_OK;
}

/**
* @brief    Stage default DCFG to buffer
* @param    p_device_id - pointer to a device ID
* @retval   Success/Error
*/
ADPD4000_DCFG_STATUS_t stage_adpd4000_dcfg(uint16_t *p_device_id) {
  if (p_device_id == NULL) {
    return ADPD4000_DCFG_STATUS_NULL_PTR;
  }

  adpd4000_fw_dcfg_clear();

  if (*p_device_id == 0) {
    // If we didn't receive a device ID, try to read it from the device
    // AdpdClDrvEfuseModuleTypeRead(p_device_id);
  }
  switch (*p_device_id) {
  case M2M2_SENSOR_ADPD4000_DEVICE_4000_G:
#ifdef DCB
    if( adpd4000_get_dcb_present_flag() ) {
        uint16_t dcb_sz = (MAXADPD4000DCBSIZE*MAX_ADPD4000_DCB_PKTS);
        adpd4000_dcb_dcfg_clear();
	if(read_adpd4000_dcb(g_current_dcb, &dcb_sz) == ADPD4000_DCB_STATUS_OK)
        {
        memcpy(&g_current_dcfg[0], &g_current_dcb[0], sizeof(g_current_dcb));
        }
        else
        {
        return ADPD4000_DCFG_STATUS_ERR;
        }
    }
    else
    {
        if(check_dcfg_created == true)
          {
            memcpy(&g_current_dcfg[0], &g_created_dcfg[0], sizeof(g_created_dcfg));
            check_dcfg_created = false;
          }
        else
          {
            memcpy(&g_current_dcfg[0], &dcfg_org_4000_g[0], sizeof(dcfg_org_4000_g));
          }
    }
#else
    memcpy(&g_current_dcfg[0], &dcfg_org_4000_g[0], sizeof(dcfg_org_4000_g));
#endif
    *p_device_id = 4000;
    break;
#ifdef EVTBOARD
  case M2M2_SENSOR_ADPD4000_DEVICE_4000_R:
    memcpy(&g_current_dcfg[0], &dcfg_org_4000_r[0], sizeof(dcfg_org_4000_r));
    *p_device_id = 4000;
    break;
  case M2M2_SENSOR_ADPD4000_DEVICE_4000_IR:
    memcpy(&g_current_dcfg[0], &dcfg_org_4000_ir[0], sizeof(dcfg_org_4000_ir));
    *p_device_id = 4000;
    break;
  case M2M2_SENSOR_ADPD4000_DEVICE_4000_B:
    memcpy(&g_current_dcfg[0], &dcfg_org_4000_b[0], sizeof(dcfg_org_4000_b));
    *p_device_id = 4000;
    break;
  case M2M2_SENSOR_ADPD4000_DEVICE_4000_G_R_IR_B:
    memcpy(&g_current_dcfg[0], &dcfg_org_4000_g_r_ir_b[0], sizeof(dcfg_org_4000_g_r_ir_b));
    *p_device_id = 4000;
    break;
#endif
  default:
  // Fallthrough to a default dcfg if we didn't get one and couldn't read it from the device
//  case M2M2_SENSOR_ADPD4000_DEVICE_4000_G:
    memcpy(&g_current_dcfg[0], &dcfg_org_4000_g[0], sizeof(dcfg_org_4000_g));
    *p_device_id = 4000;
    break;
  }
  return ADPD4000_DCFG_STATUS_OK;
}

void adpd4000_fw_dcfg_clear(void) {
  memset(&g_current_dcfg[0], 0xFF, sizeof(g_current_dcfg));
}

#ifdef DCB
void adpd4000_dcb_dcfg_clear(void) {
  memset(&g_current_dcb[0], 0xFF, sizeof(g_current_dcb));
}

// ================== ADPD_DCB Section ====================== //

/**
* @brief    Load ADPD4000 Default DCB configuration
* @param    device_id - Adpd4000 device index/type
* @retval   Status
*/
ADPD4000_DCB_STATUS_t load_adpd4000_dcb(uint16_t device_id)
{
    if (device_id == 0)
    {
        adi_adpddrv_OpenDriver();
        return ADPD4000_DCB_STATUS_OK;
    }
    if (device_id != 0)
    {
        stage_adpd4000_dcfg(&device_id);
    }
    adi_adpddrv_SoftReset();
    //adi_adpddrv_OpenDriver();

    if(write_adpd4000_dcfg(&g_current_dcfg[0]) != ADPD4000_DCFG_STATUS_OK)
    {
         NRF_LOG_INFO("Write adpd4000_dcfg Error");
         return ADPD4000_DCB_STATUS_ERR;
    }

    return ADPD4000_DCB_STATUS_OK;
}

/**@brief   Gets the entire ADPD DCB configuration written in flash
 *
 * @param adpd4000_dcb_data - pointer to dcb struct variable,
 * @param read_size: size of adpd4000_dcb_data array filled from FDS(length in Double Word (32-bits))
 * @return return value of type ADPD4000_DCB_STATUS_t
 */
ADPD4000_DCB_STATUS_t read_adpd4000_dcb(uint32_t *adpd4000_dcb_data, uint16_t* read_size)
{
    ADPD4000_DCB_STATUS_t dcb_status = ADPD4000_DCB_STATUS_ERR;

    if(adi_dcb_read_from_fds(ADI_DCB_ADPD4000_BLOCK_IDX, adpd4000_dcb_data, read_size) == DEF_OK)
    {
        dcb_status = ADPD4000_DCB_STATUS_OK;
    }
    return dcb_status;
}

/**@brief   Sets the entire ADPD DCB configuration in flash
 *
 * @param adpd4000_dcb_data - pointer to dcb struct variable,
 * @param in_size: size of adpd4000_dcb_data array(length in Double Word (32-bits))
 * @return return value of type ADPD4000_DCB_STATUS_t
 */
ADPD4000_DCB_STATUS_t write_adpd4000_dcb(uint32_t *adpd4000_dcb_data, uint16_t in_size)
{
    ADPD4000_DCB_STATUS_t dcb_status = ADPD4000_DCB_STATUS_ERR;

    if(adi_dcb_write_to_fds(ADI_DCB_ADPD4000_BLOCK_IDX, adpd4000_dcb_data, in_size) == DEF_OK)
    {
        dcb_status = ADPD4000_DCB_STATUS_OK;
    }

    return dcb_status;
}

/**
* @brief    Delete the entire ADPD4000 DCB configuration in flash
* @param    void
* @retval   Status
*/
ADPD4000_DCB_STATUS_t delete_adpd4000_dcb(void)
{
    ADPD4000_DCB_STATUS_t dcb_status = ADPD4000_DCB_STATUS_ERR;

    if(adi_dcb_delete_fds_settings(ADI_DCB_ADPD4000_BLOCK_IDX) == DEF_OK)
    {
        adpd4000_fw_dcfg_clear();
        adpd4000_dcb_dcfg_clear();
        dcb_status = ADPD4000_DCB_STATUS_OK;
    }

    return dcb_status;
}

void adpd4000_set_dcb_present_flag(bool set_flag)
{
    g_adpd4000_dcb_present = set_flag;
    NRF_LOG_INFO("Setting..ADPD4000 DCB present: %s",(g_adpd4000_dcb_present == true ? "TRUE" : "FALSE"));
}

bool adpd4000_get_dcb_present_flag(void)
{
    NRF_LOG_INFO("ADPD4000 DCB present: %s", (g_adpd4000_dcb_present == true ? "TRUE" : "FALSE"));
    return g_adpd4000_dcb_present;
}

void adpd4000_update_dcb_present_flag(void)
{
    g_adpd4000_dcb_present = adi_dcb_check_fds_entry(ADI_DCB_ADPD4000_BLOCK_IDX);
    NRF_LOG_INFO("Updated. ADPD4000 DCB present: %s", (g_adpd4000_dcb_present == true ? "TRUE" : "FALSE"));
}
#endif

/**@brief  Function to control the GPIO, which enables/disables the DG2502 switch
 *         that connects ECG electrodes to ADPD4000 - ecg application
 *
 * @param  sw_enable: 1/0 to enable/disable switch
 * @return None
 */
void DG2502_SW_control_ADPD4000(uint8_t sw_enable)
{
    if(sw_enable)
        adi_adpddrv_RegWrite(ADPD400x_REG_GPIO23, 1);//4K_SW_EN_1V8
    else
        adi_adpddrv_RegWrite(ADPD400x_REG_GPIO23,0);//4K_SW_EN_1V8
}

////////////////////////////////////////////////////////
/* Function to set the Sampling Frequency for the adpd4k*
** @param value-> odr value for the sampling frequency to be set for adpd4000 (in Hz)
*/

ADPD4000_DCFG_STATUS_t Set_adpd4000_SamplingFreq(uint16_t odr) {

