ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/adpd4000/adpd4000_dcfg.c
  ADPD4000_DCFG_STATUS_t sts = ADPD4000_DCFG_STATUS_OK;

  uint16_t fs_reg_addr = ADPD400x_REG_TS_FREQ; //0X000D-> register address for setting sampling frequency in adpd4000
  uint16_t fs_reg_data;
  uint16_t temp16;
  uint32_t lfOSC;

  adi_adpddrv_RegRead(ADPD400x_REG_SYS_CTL, &temp16);
  temp16 &= BITM_SYS_CTL_LFOSC_SEL;
  temp16 >>= BITP_SYS_CTL_LFOSC_SEL;
  if (temp16 == 1)
    lfOSC = 1000000;  // 1M clock
  else
    lfOSC = 32000;    // 32k clock

  fs_reg_data = lfOSC / odr;  //samplingFrequency = lfOSC/ODR

  if (adi_adpddrv_RegWrite(fs_reg_addr, fs_reg_data) != ADPD400xDrv_SUCCESS) 
    {
            sts = ADPD4000_DCFG_STATUS_ERR;
    }
  else
    {
            sts = ADPD4000_DCFG_STATUS_OK;
    }
  return sts;
}

/* Function to set the ecg lcfg values for adpd4k
** @param field-> refers to each entry in ecg lcfg (field = ECG4k_LCFG_FS for ecgODR)
** @param value-> odr value for the sampling frequency to be set in the lcfg (in Hz)
*/

ADPD4000_DCFG_STATUS_t Ecg4kSetLCFG(uint8_t field, uint16_t value) {

  AppECG4kCfg_Type *pCfg = &AppECG4kCfg;

  if(field < ECG4k_LCFG_MAX){
    switch(field){

    case ECG4k_LCFG_FS:
        pCfg->ECGODR = value;
        Set_adpd4000_SamplingFreq(pCfg->ECGODR);
       break;

    default:
        break;
    }
    return ADPD4000_DCFG_STATUS_OK;
  }
  return ADPD4000_DCFG_STATUS_ERR;
}


/* Function to get the ecg lcfg values for adpd4k
** @param field-> refers to each entry in ecg lcfg (field = ECG4k_LCFG_FS for ecgODR)
** @param value-> odr value to be read from the lcfg (in Hz)
*/
ADPD4000_DCFG_STATUS_t Ecg4kgGetLCFG(uint8_t field, uint16_t *value) {

  AppECG4kCfg_Type *pCfg = &AppECG4kCfg;
  if(field < ECG4k_LCFG_MAX){
    switch(field){

    case ECG4k_LCFG_FS:
      *value = pCfg->ECGODR;
      break;

    default:
      break;
   }
    return ADPD4000_DCFG_STATUS_OK;
  }
  return ADPD4000_DCFG_STATUS_ERR;
}
